modm-ext/archive-stmicro-svd/rm_rm0432_stm32l4r5agi6.svd
      <register>
        <name>FGCLUT.171</name>
        <addressOffset>0x6ac</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.172</name>
        <addressOffset>0x6b0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.173</name>
        <addressOffset>0x6b4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.174</name>
        <addressOffset>0x6b8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.175</name>
        <addressOffset>0x6bc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.176</name>
        <addressOffset>0x6c0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.177</name>
        <addressOffset>0x6c4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.178</name>
        <addressOffset>0x6c8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.179</name>
        <addressOffset>0x6cc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.180</name>
        <addressOffset>0x6d0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.181</name>
        <addressOffset>0x6d4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.182</name>
        <addressOffset>0x6d8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.183</name>
        <addressOffset>0x6dc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.184</name>
        <addressOffset>0x6e0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.185</name>
        <addressOffset>0x6e4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.186</name>
        <addressOffset>0x6e8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.187</name>
        <addressOffset>0x6ec</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.188</name>
        <addressOffset>0x6f0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.189</name>
        <addressOffset>0x6f4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.190</name>
        <addressOffset>0x6f8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.191</name>
        <addressOffset>0x6fc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.192</name>
        <addressOffset>0x700</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.193</name>
        <addressOffset>0x704</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.194</name>
        <addressOffset>0x708</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.195</name>
        <addressOffset>0x70c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.196</name>
        <addressOffset>0x710</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.197</name>
        <addressOffset>0x714</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.198</name>
        <addressOffset>0x718</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.199</name>
        <addressOffset>0x71c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.200</name>
        <addressOffset>0x720</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FGCLUT.201</name>
        <addressOffset>0x724</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
