modm-ext/archive-stmicro-svd/rm_rm0432_stm32l4r5agi6.svd
      <register>
        <name>BGCLUT.101</name>
        <addressOffset>0x994</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.102</name>
        <addressOffset>0x998</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.103</name>
        <addressOffset>0x99c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.104</name>
        <addressOffset>0x9a0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.105</name>
        <addressOffset>0x9a4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.106</name>
        <addressOffset>0x9a8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.107</name>
        <addressOffset>0x9ac</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.108</name>
        <addressOffset>0x9b0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.109</name>
        <addressOffset>0x9b4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.110</name>
        <addressOffset>0x9b8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.111</name>
        <addressOffset>0x9bc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.112</name>
        <addressOffset>0x9c0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.113</name>
        <addressOffset>0x9c4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.114</name>
        <addressOffset>0x9c8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.115</name>
        <addressOffset>0x9cc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.116</name>
        <addressOffset>0x9d0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.117</name>
        <addressOffset>0x9d4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.118</name>
        <addressOffset>0x9d8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.119</name>
        <addressOffset>0x9dc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.120</name>
        <addressOffset>0x9e0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.121</name>
        <addressOffset>0x9e4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.122</name>
        <addressOffset>0x9e8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.123</name>
        <addressOffset>0x9ec</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.124</name>
        <addressOffset>0x9f0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.125</name>
        <addressOffset>0x9f4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.126</name>
        <addressOffset>0x9f8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.127</name>
        <addressOffset>0x9fc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.128</name>
        <addressOffset>0xa00</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.129</name>
        <addressOffset>0xa04</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.130</name>
        <addressOffset>0xa08</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BGCLUT.131</name>
        <addressOffset>0xa0c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>BLUE&lt;y&gt;</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>GREEN&lt;y&gt;</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>RED&lt;y&gt;</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>ALPHA&lt;y&gt;</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
